
function recursion(n) {
    do {
        console.log(`Num = ${n--}`)
    }
    while (n >= 0)
}
// recursion(10)
// Некоректне використання рекурсії:

// Цикл do while: Ви використовуєте цикл do while, 
// тоді як для рекурсії він не потрібен. 
// Рекурсія досягається за рахунок повторних викликів функції самої себе.
// Зміна значення аргументу: Ви змінюєте значення n всередині циклу, 
// що може призвести до непередбачуваних результатів в інших контекстах. 
// Краще використовувати нову змінну для зберігання зменшеного значення.


function recursion(n) {
    console.log(`Num = ${n}`);
    if (n > 0) { 
      recursion(n - 1);
    }
  }
  
  recursion(5);
